announcements/emacs-start-speed-up.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-21 Mon 12:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Start-Up: Speeding It Up</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="raman" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Start-Up: Speeding It Up</h1>
<div id="outline-container-orgc53dd52" class="outline-2">
<h2 id="orgc53dd52"><span class="section-number-2">1</span> TL;DR:</h2>
<div class="outline-text-2" id="text-1">
<p>
Describes my Emacs start-up file, and what I did to speed it up from
12 seconds to under 4 seconds.
</p>
</div>
</div>
<div id="outline-container-org7b5a545" class="outline-2">
<h2 id="org7b5a545"><span class="section-number-2">2</span> Overview Of Steps</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Byte-compile start-up files.</li>
<li>Temporarily increase <span class="underline">gc-cons-threshold</span> during startup.</li>
<li>Load package autoloads (not packages) during start-up.</li>
<li>Use <span class="underline">eval-after-load</span> to advantage for post-package setup.</li>
<li>Lexically bind <span class="underline">file-name-handler-alist</span> to <span class="underline">nil</span> if start-up
is split across many files.</li>
<li>Used memoization to avoid network lookup of current location during startup.</li>
</ul>


<p>
I have  a large number of elpa/melpa packages installed:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(length load-path)
</pre>
</div>
<pre class="example">
400

</pre>

<p>
With the above, my emacs (Emacs 26 built from Git) startup time is on
average 4 seconds.  This includes starting up emacspeak (including
speech servers), as well as launching a number of project-specific
shell buffers.  Given that I rarely restart Emacs, the startup time is
academic &#x2014; but speeding up Emacs startup did get me to clean-up my
Emacs setup.
</p>
</div>
</div>

<div id="outline-container-orgb1a8215" class="outline-2">
<h2 id="orgb1a8215"><span class="section-number-2">3</span> Introduction</h2>
<div class="outline-text-2" id="text-3">
<p>
I have now used Emacs for more than 25 years, and my <a href="https://github.com/tvraman/emacspeak/blob/master/tvr/emacs-startup.el#L1">Emacs start-up
file</a> has followed the same structure through this time.
</p>

<ol class="org-ol">
<li>The init file defines a <code>start-up-emacs</code> function that does the
bulk of the work.</li>
<li>Package-specific configuration is split up into
<code>&lt;package&gt;-prepare.el</code> files.</li>
<li>All of these files are byte-compiled.</li>
</ol>

<p>
As a first step, I added code to my start-up file to time the loading
of various modules.
</p>
</div>
</div>

<div id="outline-container-org2a2afbe" class="outline-2">
<h2 id="org2a2afbe"><span class="section-number-2">4</span> Load Byte-Compiled Start-Up File</h2>
<div class="outline-text-2" id="text-4">
<p>
I keep my <code>emacs-startup.el</code> checked into GitHub.
My Emacs init-file is a symlink to the byte-compiled version of the
above &#x2014; this is something that goes back to my time as a
grad-student at Cornell (when GitHub of course did not exist).
That is also when I originally learnt the trick of temporarily setting
<span class="underline">gc-cons-threshold</span> to 8MB &#x2014; Emacs' default is 800K.
</p>
</div>
</div>

<div id="outline-container-org7451279" class="outline-2">
<h2 id="org7451279"><span class="section-number-2">5</span> Package Autoloads And <code>eval-after-load</code></h2>
<div class="outline-text-2" id="text-5">
<p>
Over time, some of the package-specific setup files had come to
directly load packages &#x2014; it just made it easier to do
package-specific setup at the time.  As part of the cleanup, I updated
these to strictly load package-autoload files and wrapped post-package
setup code in <code>eval-after-load</code> &#x2014; this is effectively the same as
using <code>use-package</code>.
</p>
</div>
</div>


<div id="outline-container-org90a1e86" class="outline-2">
<h2 id="org90a1e86"><span class="section-number-2">6</span> Loading Files Faster</h2>
<div class="outline-text-2" id="text-6">
<p>
Emacs has an extremely flexible mechanism for loading files &#x2014; this
means you can load compressed, encrypted or remote files without
having to worry about it. That flexibility comes at a cost &#x2014; if you
are sure you dont need this flexibility during start-up, then locally
binding <code>file-name-handler-alist</code> to <code>nil</code> is a big win &#x2014; in my
case, it  sped things up by 50%.
</p>
</div>
</div>

<div id="outline-container-org2a7c3a1" class="outline-2">
<h2 id="org2a7c3a1"><span class="section-number-2">7</span> Avoid Network Calls During Start-Up</h2>
<div class="outline-text-2" id="text-7">
<p>
In my case, I set <code>calendar-latitude</code> and <code>calendar-longitude</code> by
geocoding my address &#x2014; geocoding is done by calling the Google Maps
API.  The geocoding API is plenty fast that you normally dont notice
it &#x2014; but it was adding anywhere from 1&#x2013;3 seconds during
startup. Since my address doesn't change that often, I updated module
<a href="https://github.com/tvraman/emacspeak/blob/master/lisp/g-client/gmaps.el#L1">gmaps</a> to use a memoized version. My address is set via <code>Customize</code>,
and the geocoded lat/long is saved to disk automatically.
</p>
</div>
</div>




<div id="outline-container-org049dfc4" class="outline-2">
<h2 id="org049dfc4"><span class="section-number-2">8</span> References</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li><a href="https://anuragpeshne.github.io/essays/emacsSpeed.html">Emacs Speed</a> What got it all started.</li>
<li><a href="https://www.reddit.com/r/emacs/comments/3kqt6e/2_easy_little_known_steps_to_speed_up_emacs_start/">file-name-handler-alist</a> The article that gave me the most useful
tip of them all.</li>
</ol>


<p>
Net 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-08-21 Mon 00:00</p>
<p class="author">Author: raman</p>
<p class="date">Created: 2017-08-21 Mon 12:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
